package homework.homework_09;

//программа предлагает пользователю ввести четырехзначное число
//- Причем: мы можем получать от пользователя **ТОЛЬКО** строки. Данные в формате String
//- Если число не четырехзначное, должно вывестись на экран сообщение об ошибке и работа программы завершается
//- Проверить, является ли число "счастливым билетом". Т.е. совпадает ли сумма цифр первых двух цифр числа с суммой третьей и четвертой цифры
//
//Пример:
//- число 1450 -> (1+4) = 5; (5+0) = 5; 5 равно 5 - число счастливое
//- число 1654 -> (1+6) = 7; (5+4) = 9; 7 не равно 9 - число НЕ является счастливым

public class Task5 {
    }


