package homework.homework_06;
// Тема: создание переменной типа String.
//Напишите программу в которой создайте переменную
//типа String и присвойте ей в качестве начального значения
//ваше имя. Выведете на консоль значение этой переменной.


public class NameStr {
    public static void main(String[] args) {

    String name = "Anastasia";
        System.out.println(name);


        // Напишите программу в которой создайте переменную
        //типа String и присвойте ей в качестве начального значения
        //ваше имя. Выведете на консоль приветствие типа "Hi YourName".

        System.out.println("Hi " + name);






    }


}
